app/views/shared/_user_info.html.erb

<span>
  <%= pluralize(current_user.microposts.count, "tweets") %>
---
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 1]]