app/views/pages/home.html.erb

                        <div class="col-sm-6" style="font-size: 80%; opacity: 0.7;">TWEETS<br>
                            <h6 style="color: #00B4B4; font-size: 200%;"><%= current_user.posts.count %></h6>
---
SELECT "posts".* FROM "posts"  ORDER BY "posts"."created_at" DESC
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 6]]