app/controllers/pages_controller.rb

  def home
    @post = Post.all
---
SELECT "posts".* FROM "posts"  ORDER BY "posts"."created_at" DESC

  def profile
    #grab username from URL as ID
    if (User.find_by_username(params[:id]))
      @username = params[:id]
     # @created_at = user.created_at
    else
      #redirect to 404
      redirect_to root_path, :notice=> "User not found!!"
    end
    @post = Post.all.where("user_id = ?", User.find_by_username(params[:id]).id)
    @newpost = Post.new

    @toFollow = User.all.last(5)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "hanh"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]
SELECT "posts".* FROM "posts" WHERE (user_id = 5)  ORDER BY "posts"."created_at" DESC
SELECT  "users".* FROM "users"  ORDER BY "users"."id" DESC LIMIT 5
SELECT "posts".* FROM "posts"  ORDER BY "posts"."created_at" DESC

  def explore
    @post = Post.all
    @newpost = Post.new
    @toFollow = User.all.last(5)
---
SELECT "posts".* FROM "posts"  ORDER BY "posts"."created_at" DESC
SELECT  "users".* FROM "users"  ORDER BY "users"."id" DESC LIMIT 5